nthuepl/CodeGenerator/python/sdcc/cc2540sfr.h
/*
    cc2540sfr.h

    generated by cc2540sfr_c.py
  */
#ifndef __cc2540sfr_h__
#define __cc2540sfr_h__
__sbit __at (0x80) P0_0;
__sbit __at (0x81) P0_1;
__sbit __at (0x82) P0_2;
__sbit __at (0x83) P0_3;
__sbit __at (0x84) P0_4;
__sbit __at (0x85) P0_5;
__sbit __at (0x86) P0_6;
__sbit __at (0x87) P0_7;
__sbit __at (0x88) TCON_0;
__sbit __at (0x88) TCON_IT0;
__sbit __at (0x89) TCON_1;
__sbit __at (0x89) TCON_RFERRIF;
__sbit __at (0x8a) TCON_2;
__sbit __at (0x8a) TCON_IT1;
__sbit __at (0x8b) TCON_3;
__sbit __at (0x8b) TCON_URX0IF;
__sbit __at (0x8c) TCON_4;
__sbit __at (0x8d) TCON_5;
__sbit __at (0x8d) TCON_ADCIF;
__sbit __at (0x8e) TCON_6;
__sbit __at (0x8f) TCON_7;
__sbit __at (0x8f) TCON_URX1IF;
__sbit __at (0x90) P1_0;
__sbit __at (0x91) P1_1;
__sbit __at (0x92) P1_2;
__sbit __at (0x93) P1_3;
__sbit __at (0x94) P1_4;
__sbit __at (0x95) P1_5;
__sbit __at (0x96) P1_6;
__sbit __at (0x97) P1_7;
__sbit __at (0x98) S0CON_0;
__sbit __at (0x98) S0CON_ENCIF_0;
__sbit __at (0x99) S0CON_1;
__sbit __at (0x99) S0CON_ENCIF_1;
__sbit __at (0x9a) S0CON_2;
__sbit __at (0x9b) S0CON_3;
__sbit __at (0x9c) S0CON_4;
__sbit __at (0x9d) S0CON_5;
__sbit __at (0x9e) S0CON_6;
__sbit __at (0x9f) S0CON_7;
__sbit __at (0xa0) P2_0;
__sbit __at (0xa0) P2__0;
__sbit __at (0xa1) P2_1;
__sbit __at (0xa1) P2__1;
__sbit __at (0xa2) P2_2;
__sbit __at (0xa2) P2__2;
__sbit __at (0xa3) P2_3;
__sbit __at (0xa3) P2__3;
__sbit __at (0xa4) P2_4;
__sbit __at (0xa4) P2__4;
__sbit __at (0xa5) P2_5;
__sbit __at (0xa6) P2_6;
__sbit __at (0xa7) P2_7;
__sbit __at (0xa8) IEN0_0;
__sbit __at (0xa8) IEN0_RFERRIE;
__sbit __at (0xa9) IEN0_1;
__sbit __at (0xa9) IEN0_ADCIE;
__sbit __at (0xaa) IEN0_2;
__sbit __at (0xaa) IEN0_URX0IE;
__sbit __at (0xab) IEN0_3;
__sbit __at (0xab) IEN0_URX1IE;
__sbit __at (0xac) IEN0_4;
__sbit __at (0xac) IEN0_ENCIE;
__sbit __at (0xad) IEN0_5;
__sbit __at (0xad) IEN0_STIE;
__sbit __at (0xae) IEN0_6;
__sbit __at (0xaf) IEN0_7;
__sbit __at (0xaf) IEN0_EA;
__sbit __at (0xb8) IEN1_0;
__sbit __at (0xb8) IEN1_DMAIE;
__sbit __at (0xb9) IEN1_1;
__sbit __at (0xb9) IEN1_T1IE;
__sbit __at (0xba) IEN1_2;
__sbit __at (0xba) IEN1_T2IE;
__sbit __at (0xbb) IEN1_3;
__sbit __at (0xbb) IEN1_T3IE;
__sbit __at (0xbc) IEN1_4;
__sbit __at (0xbc) IEN1_T4IE;
__sbit __at (0xbd) IEN1_5;
__sbit __at (0xbd) IEN1_P0IE;
__sbit __at (0xbe) IEN1_6;
__sbit __at (0xbf) IEN1_7;
__sbit __at (0xc0) IRCON_0;
__sbit __at (0xc0) IRCON_DMAIF;
__sbit __at (0xc1) IRCON_1;
__sbit __at (0xc1) IRCON_T1IF;
__sbit __at (0xc2) IRCON_2;
__sbit __at (0xc2) IRCON_T2IF;
__sbit __at (0xc3) IRCON_3;
__sbit __at (0xc3) IRCON_T3IF;
__sbit __at (0xc4) IRCON_4;
__sbit __at (0xc4) IRCON_T4IF;
__sbit __at (0xc5) IRCON_5;
__sbit __at (0xc5) IRCON_P0IF;
__sbit __at (0xc6) IRCON_6;
__sbit __at (0xc7) IRCON_7;
__sbit __at (0xc7) IRCON_STIF;
__sbit __at (0xd0) PSW_0;
__sbit __at (0xd0) PSW_P;
__sbit __at (0xd1) PSW_1;
__sbit __at (0xd1) PSW_F1;
__sbit __at (0xd2) PSW_2;
__sbit __at (0xd2) PSW_OV;
__sbit __at (0xd3) PSW_3;
__sbit __at (0xd4) PSW_4;
__sbit __at (0xd5) PSW_5;
__sbit __at (0xd5) PSW_F0;
__sbit __at (0xd6) PSW_6;
__sbit __at (0xd6) PSW_AC;
__sbit __at (0xd7) PSW_7;
__sbit __at (0xd7) PSW_CY;
__sbit __at (0xd8) TIMIF_0;
__sbit __at (0xd8) TIMIF_T3OVFIF;
__sbit __at (0xd9) TIMIF_1;
__sbit __at (0xd9) TIMIF_T3CH0IF;
__sbit __at (0xda) TIMIF_2;
__sbit __at (0xda) TIMIF_T3CH1IF;
__sbit __at (0xdb) TIMIF_3;
__sbit __at (0xdb) TIMIF_T4OVFIF;
__sbit __at (0xdc) TIMIF_4;
__sbit __at (0xdc) TIMIF_T4CH0IF;
__sbit __at (0xdd) TIMIF_5;
__sbit __at (0xdd) TIMIF_T4CH1IF;
__sbit __at (0xde) TIMIF_6;
__sbit __at (0xde) TIMIF_T1OVFIM;
__sbit __at (0xdf) TIMIF_7;
__sbit __at (0xe0) ACC_0;
__sbit __at (0xe1) ACC_1;
__sbit __at (0xe2) ACC_2;
__sbit __at (0xe3) ACC_3;
__sbit __at (0xe4) ACC_4;
__sbit __at (0xe5) ACC_5;
__sbit __at (0xe6) ACC_6;
__sbit __at (0xe7) ACC_7;
__sbit __at (0xe8) IRCON2_0;
__sbit __at (0xe8) IRCON2_P2IF;
__sbit __at (0xe9) IRCON2_1;
__sbit __at (0xe9) IRCON2_UTX0IF;
__sbit __at (0xea) IRCON2_2;
__sbit __at (0xea) IRCON2_UTX1IF;
__sbit __at (0xeb) IRCON2_3;
__sbit __at (0xeb) IRCON2_P1IF;
__sbit __at (0xec) IRCON2_4;
__sbit __at (0xec) IRCON2_WDTIF;
__sbit __at (0xed) IRCON2_5;
__sbit __at (0xee) IRCON2_6;
__sbit __at (0xef) IRCON2_7;
__sbit __at (0xf0) B_0;
__sbit __at (0xf1) B_1;
__sbit __at (0xf2) B_2;
__sbit __at (0xf3) B_3;
__sbit __at (0xf4) B_4;
__sbit __at (0xf5) B_5;
__sbit __at (0xf6) B_6;
__sbit __at (0xf7) B_7;
__sbit __at (0xf8) U1CSR_0;
__sbit __at (0xf8) U1CSR_ACTIVE;
__sbit __at (0xf9) U1CSR_1;
__sbit __at (0xf9) U1CSR_TX_BYTE;
__sbit __at (0xfa) U1CSR_2;
__sbit __at (0xfa) U1CSR_RX_BYTE;
__sbit __at (0xfb) U1CSR_3;
__sbit __at (0xfb) U1CSR_ERR;
__sbit __at (0xfc) U1CSR_4;
__sbit __at (0xfc) U1CSR_FE;
__sbit __at (0xfd) U1CSR_5;
__sbit __at (0xfd) U1CSR_SLAVE;
__sbit __at (0xfe) U1CSR_6;
__sbit __at (0xfe) U1CSR_RE;
__sbit __at (0xff) U1CSR_7;
__sbit __at (0xff) U1CSR_MODE;
__sfr __at (0x80) P0;
__sfr __at (0x81) SP;
__sfr __at (0x82) DPL0;
__sfr __at (0x83) DPH0;
__sfr __at (0x84) DPL1;
__sfr __at (0x85) DPH1;
__sfr __at (0x86) U0CSR;
__sfr __at (0x87) PCON;
__sfr __at (0x88) TCON;
__sfr __at (0x89) P0IFG;
__sfr __at (0x8a) P1IFG;
__sfr __at (0x8b) P2IFG;
__sfr __at (0x8c) PICTL;
__sfr __at (0x8d) P1IEN;
__sfr __at (0x8f) P0INP;
__sfr __at (0x90) P1;
__sfr __at (0x91) RFIRQF1;
__sfr __at (0x92) DPS;
__sfr __at (0x93) MPAGE;
__sfr __at (0x94) T2CTRL;
__sfr __at (0x95) ST0;
__sfr __at (0x95) STLOAD;
__sfr __at (0x96) ST1;
__sfr __at (0x97) ST2;
__sfr __at (0x98) S0CON;
__sfr __at (0x9a) IEN2;
__sfr __at (0x9b) S1CON;
__sfr __at (0x9c) T2EVTCFG;
__sfr __at (0x9d) SLEEPSTA;
__sfr __at (0x9e) CLKCONSTA;
__sfr __at (0x9f) FMAP;
__sfr __at (0xa0) P2;
__sfr __at (0xa1) T2IRQF;
__sfr __at (0xa2) T2M0;
__sfr __at (0xa3) T2M1;
__sfr __at (0xa4) T2MOVF0;
__sfr __at (0xa5) T2MOVF1;
__sfr __at (0xa6) T2MOVF2;
__sfr __at (0xa7) T2IRQM;
__sfr __at (0xa8) IEN0;
__sfr __at (0xa9) IP0;
__sfr __at (0xab) P0IEN;
__sfr __at (0xac) P2IEN;
__sfr __at (0xae) PMUX;
__sfr __at (0xaf) T1STAT;
__sfr __at (0xb1) ENCDI;
__sfr __at (0xb2) ENCDO;
__sfr __at (0xb3) ENCCS;
__sfr __at (0xb4) ADCCON1;
__sfr __at (0xb5) ADCCON2;
__sfr __at (0xb6) ADCCON3;
__sfr __at (0xb8) IEN1;
__sfr __at (0xb9) IP1;
__sfr __at (0xba) ADCL;
__sfr __at (0xbb) ADCH;
__sfr __at (0xbc) RNDL;
__sfr __at (0xbd) RNDH;
__sfr __at (0xbe) SLEEPCMD;
__sfr __at (0xbf) RFERRF;
__sfr __at (0xc0) IRCON;
__sfr __at (0xc1) U0DBUF;
__sfr __at (0xc2) U0BAUD;
__sfr __at (0xc3) T2MSEL;
__sfr __at (0xc4) U0UCR;
__sfr __at (0xc5) U0GCR;
__sfr __at (0xc6) CLKCONCMD;
__sfr __at (0xc7) MEMCTR;
__sfr __at (0xc9) WDCTL;
__sfr __at (0xca) T3CNT;
__sfr __at (0xcb) T3CTL;
__sfr __at (0xcc) T3CCTL0;
__sfr __at (0xcd) T3CC0;
__sfr __at (0xce) T3CCTL1;
__sfr __at (0xcf) T3CC1;
__sfr __at (0xd0) PSW;
__sfr __at (0xd1) DMAIRQ;
__sfr __at (0xd2) DMA1CFGL;
__sfr __at (0xd3) DMA1CFGH;
__sfr __at (0xd4) DMA0CFGL;
__sfr __at (0xd5) DMA0CFGH;
__sfr __at (0xd6) DMAARM;
__sfr __at (0xd7) DMAREQ;
__sfr __at (0xd8) TIMIF;
__sfr __at (0xd9) RFD;
__sfr __at (0xda) T1CC0L;
__sfr __at (0xdb) T1CC0H;
__sfr __at (0xdc) T1CC1L;
__sfr __at (0xdd) T1CC1H;
__sfr __at (0xde) T1CC2L;
__sfr __at (0xdf) T1CC2H;
__sfr __at (0xe0) ACC;
__sfr __at (0xe1) RFST;
__sfr __at (0xe2) T1CNTL;
__sfr __at (0xe3) T1CNTH;
__sfr __at (0xe4) T1CTL;
__sfr __at (0xe5) T1CCTL0;
__sfr __at (0xe6) T1CCTL1;
__sfr __at (0xe7) T1CCTL2;
__sfr __at (0xe8) IRCON2;
__sfr __at (0xe9) RFIRQF0;
__sfr __at (0xea) T4CNT;
__sfr __at (0xeb) T4CTL;
__sfr __at (0xec) T4CCTL0;
__sfr __at (0xed) T4CC0;
__sfr __at (0xee) T4CCTL1;
__sfr __at (0xef) T4CC1;
__sfr __at (0xf0) B;
__sfr __at (0xf1) PERCFG;
__sfr __at (0xf2) APCFG;
__sfr __at (0xf3) P0SEL;
__sfr __at (0xf4) P1SEL;
__sfr __at (0xf5) P2SEL;
__sfr __at (0xf6) P1INP;
__sfr __at (0xf7) P2INP;
__sfr __at (0xf8) U1CSR;
__sfr __at (0xf9) U1DBUF;
__sfr __at (0xfa) U1BAUD;
__sfr __at (0xfb) U1UCR;
__sfr __at (0xfc) U1GCR;
__sfr __at (0xfd) P0DIR;
__sfr __at (0xfe) P1DIR;
__sfr __at (0xff) P2DIR;
__xdata __at (0x618d) RFSTAT;
__xdata __at (0x61a9) ATEST;
__xdata __at (0x61ad) OPAMPMC;
__xdata __at (0x61ae) RFC_OBS;
__xdata __at (0x61af) RFC_OBS_CTRL1;
__xdata __at (0x61b0) RFC_OBS_CTRL2;
__xdata __at (0x6200) USBADDR;
__xdata __at (0x6201) USBPOW;
__xdata __at (0x6202) USBIIF;
__xdata __at (0x6204) USBOIF;
__xdata __at (0x6207) USBIIE;
__xdata __at (0x6209) USBOIE;
__xdata __at (0x620b) USBCIE;
__xdata __at (0x620c) USBFRML;
__xdata __at (0x620d) USBFRMH;
__xdata __at (0x620e) USBINDEX;
__xdata __at (0x620f) USBCTRL;
__xdata __at (0x6210) USBMAXI;
__xdata __at (0x6211) USBCS0;
__xdata __at (0x6211) USBCSIL;
__xdata __at (0x6243) OBSSEL0;
__xdata __at (0x6244) OBSSEL1;
__xdata __at (0x6245) OBSSEL2;
__xdata __at (0x6246) OBSSEL3;
__xdata __at (0x6247) OBSSEL4;
__xdata __at (0x6248) OBSSEL5;
__xdata __at (0x6249) CHVER;
__xdata __at (0x624a) CHIPID;
__xdata __at (0x624b) TR0;
__xdata __at (0x6260) DBGDATA;
__xdata __at (0x6264) BATTMON;
__xdata __at (0x6265) IVCTRL;
__xdata __at (0x6270) FCTL;
__xdata __at (0x6271) FADDRL;
__xdata __at (0x6272) FADDRH;
__xdata __at (0x6273) FWDATA;
__xdata __at (0x6276) CHIPINFO0;
__xdata __at (0x6277) CHIPINFO1;
__xdata __at (0x6281) IRCTL;
__xdata __at (0x6290) CLD;
__xdata __at (0x62a3) T1CCTL3;
__xdata __at (0x62a4) T1CCTL4;
__xdata __at (0x62ac) T1CC3L;
__xdata __at (0x62ad) T1CC3H;
__xdata __at (0x62ae) T1CC4L;
__xdata __at (0x62af) T1CC4H;
__xdata __at (0x62b0) STCC;
__xdata __at (0x62b1) STCS;
__xdata __at (0x62b2) STCV0;
__xdata __at (0x62b3) STCV1;
__xdata __at (0x62b4) STCV2;
__xdata __at (0x62c0) OPAMPC;
__xdata __at (0x62c1) OPAMPS;
__xdata __at (0x62d0) CMPCTL;
#endif /* __cc2540sfr_h__ */
